clear all
clc
x=1:0.25:2.25;
t=0:5:25;
a=[2.77,1.54,0.74,0.48,0.25,0.04]; 
b=[2.34,1.45,0.76,0.53,0.21,0.11];
c=[1.03,1.54,2.88,3.45,3.76,4.92];
e=[2.77,1.64,0.84,0.58,0.35,0.14]; 
f=[2.34,1.75,0.66,0.43,0.11,0.03];
g=[1.03,0.54,0.78,0.85,0.96,1.02];
subplot(1,2,1);
plot(x,a,'-*b',x,b,'-or',x,c,'-pg'); %线性，颜色，标记
axis([1,2.25,0,5])  %确定x轴与y轴框图大小
set(gca,'XTick',[1:0.25:2.25])
set(gca,'YTick',[0:0.5:5])
legend('Err','Fnew','Mnew');   %右上角标注
xlabel('θ')  %x轴坐标描述
ylabel('错误率error') %y轴坐标描述
subplot(1,2,2);
plot(t,e,'-*b',t,f,'-or',t,g,'-pg'); %线性，颜色，标记
axis([3,25,0,3])  %确定x轴与y轴框图大小
set(gca,'XTick',[0:5:25])
set(gca,'YTick',[0:0.2:3])
legend('Err','Fnew','Mnew');   %右上角标注
xlabel('LOF邻域')  %x轴坐标描述
ylabel('错误率error') %y轴坐标描述


